app/controllers/expenses_controller.rb

INSERT INTO "expenses" ("spentperson", "amount", "otherperson", "reason", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["spentperson", "dnko"], ["amount", 7800], ["otherperson", "njdnkl"], ["reason", "nsjkcja"], ["created_at", "2015-06-05 05:39:49.269441"], ["updated_at", "2015-06-05 05:39:49.269441"]]
---
def create
@expense = Expense.new(expense_params)
if @expense.save

SELECT  "expenses".* FROM "expenses" WHERE "expenses"."id" = ? LIMIT 1  [["id", 1]]
---
def show
  @expense = Expense.find(params[:id])

SELECT  "expenses".* FROM "expenses" WHERE "expenses"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "expenses" SET "spentperson" = ?, "amount" = ?, "otherperson" = ?, "reason" = ?, "updated_at" = ? WHERE "expenses"."id" = ?  [["spentperson", "uma"], ["amount", 80], ["otherperson", "jay"], ["reason", "drop"], ["updated_at", "2015-06-05 12:14:47.410488"], ["id", 1]]
---
def update
  @expense = Expense.find(params[:id])

  if @expense.update(expense_params)

SELECT  "expenses".* FROM "expenses" WHERE "expenses"."id" = ? LIMIT 1  [["id", 1]]
---
def edit
  @expense = Expense.find(params[:id])

SELECT  "expenses".* FROM "expenses" WHERE "expenses"."id" = ? LIMIT 1  [["id", 7]]
DELETE FROM "expenses" WHERE "expenses"."id" = ?  [["id", 7]]
---
def destroy
  @expense = Expense.find(params[:id])
  @expense.destroy